---
type: DimensionSegmentArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# DimensionSegmentArray

`Autodesk.Revit.DB.DimensionSegmentArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DimensionSegmentArray | — | `public DimensionSegmentArray ()` |
| Method | Append | — | `public virtual void Append ( DimensionSegment item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual DimensionSegmentArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( DimensionSegment item , int index )` |
| Method | ReverseIterator | — | `public virtual DimensionSegmentArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual DimensionSegment this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |